In [3]:
import pandas as pd
import pickle
import numpy as np
from sklearn.model_selection import train_test_split
import catboost
from catboost import CatBoostClassifier

In [4]:
data=pd.read_csv("german_creditrisk_data.csv")

In [5]:
data.head()

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,credit_risk
0,67,male,2,own,NaN,little,1169,6,radio/TV,1
1,22,female,2,own,little,moderate,5951,48,radio/TV,0
2,49,male,1,own,little,NaN,2096,12,education,1
3,45,male,2,free,little,little,7882,42,furniture/equipment,1
4,53,male,2,free,little,little,4870,24,car,0

In [8]:
data.describe()

               Age          Job  Credit amount     Duration  credit_risk
count  1000.000000  1000.000000    1000.000000  1000.000000  1000.000000
mean     35.546000     1.904000    3271.258000    20.903000     0.700000
std      11.375469     0.653614    2822.736876    12.058814     0.458487
min      19.000000     0.000000     250.000000     4.000000     0.000000
25%      27.000000     2.000000    1365.500000    12.000000     0.000000
50%      33.000000     2.000000    2319.500000    18.000000     1.000000
75%      42.000000     2.000000    3972.250000    24.000000     1.000000
max      75.000000     3.000000   18424.000000    72.000000     1.000000

In [11]:
data.shape

(1000, 10)

In [9]:
pd.isnull(data).sum()

Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
credit_risk           0
dtype: int64

In [ ]:
data.fillna(Saving accounts" )